[
  {
    "main_topic": "Company Regulation",
    "sub_topic": "Termination of Appointment",
    "mcl_codes": "500.1208b, .1209",
    "percentage": "11%",
    "num_items": 17,
    "study_content": "An insurer must notify the Commissioner within 30 days of terminating a producer's appointment. They must also mail a copy of the notification to the producer within 15 days."
  },
  {
    "main_topic": "Disciplinary Actions",
    "sub_topic": "False Statement",
    "mcl_codes": "500.1015, .2014, .2018, .2055, .2062, .2064",
    "percentage": "11%",
    "num_items": 17,
    "study_content": "It is illegal to knowingly make, publish, or circulate any false or maliciously critical statement regarding the financial condition of an insurer intended to deceive."
  },
  {
    "main_topic": "Disciplinary Actions",
    "sub_topic": "Boycott, Coercion, and Intimidation",
    "mcl_codes": "500.1242, .2012",
    "percentage": "11%",
    "num_items": 17,
    "study_content": "Entering into any agreement to commit an act of boycott, coercion, or intimidation resulting in unreasonable restraint of, or monopoly in, the business of insurance is strictly prohibited."
  },
  {
    "main_topic": "Disciplinary Actions",
    "sub_topic": "Unfair Discrimination",
    "mcl_codes": "500.2019, .2020, .2027, .2082",
    "percentage": "11%",
    "num_items": 17,
    "study_content": "Insurers cannot charge different rates or offer different benefits to individuals of the same risk class. Discrimination based on race, color, creed, or national origin is strictly forbidden."
  },
  {
    "main_topic": "Disciplinary Actions",
    "sub_topic": "Rebating",
    "mcl_codes": "500.2024, .2024a, .2066, .2069, .2070",
    "percentage": "11%",
    "num_items": 17,
    "study_content": "Offering anything of value (money, gifts, or special favors) that is not specified in the insurance contract as an inducement to buy insurance is illegal. Both offering and accepting a rebate are violations."
  },
  {
    "main_topic": "Disciplinary Actions",
    "sub_topic": "Fiduciary Responsibilities",
    "mcl_codes": "500.1207",
    "percentage": "11%",
    "num_items": 17,
    "study_content": "A producer acting as an agent holds all premiums collected in a fiduciary trust. Misappropriating or converting these funds for personal use is a serious violation of trust and law."
  }
]
